wsdl/RMD_DocumentRepository.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions 
	xmlns="http://schemas.xmlsoap.org/wsdl/" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:wsoap11="http://schemas.xmlsoap.org/wsdl/soap/" 
	xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/" 
	xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl/" 
	xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" 
	xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" 
	xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" 
	xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" 
	xmlns:xds="urn:ihe:iti:xds-b:2007" 
	xmlns:rmd="urn:ihe:iti:rmd:2017" 
	targetNamespace="urn:ihe:iti:rmd:2017"
	name="DocumentRepository">
	<documentation>IHE ITI RMD - Remove Documents Transaction</documentation>
	<types>
		<xsd:schema elementFormDefault="qualified" targetNamespace="urn:ihe:iti:rmd:2017" xmlns:rmd="urn:ihe:iti:rmd:2017">
			<xsd:include schemaLocation="../schema/IHE/RMD.xsd"/> 
		</xsd:schema>
		<xsd:schema elementFormDefault="qualified" targetNamespace="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
			<xsd:include schemaLocation="../schema/ebRS30/rs.xsd"/>
		</xsd:schema>
		<xsd:schema elementFormDefault="qualified" targetNamespace="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
			<xsd:include schemaLocation="../schema/ebRS30/lcm.xsd"/>
		</xsd:schema>
		<xsd:schema elementFormDefault="qualified" targetNamespace="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
			<xsd:include schemaLocation="../schema/ebRS30/rim.xsd"/>
		</xsd:schema>
	</types>
	<message name="RemoveDocuments_Message">
		<documentation>Remove Documents Request</documentation>
		<part name="body" element="rmd:RemoveDocumentsRequest"/>
	</message>
	<message name="RemoveDocumentsResponse_Message">
		<documentation>Remove Documents Response</documentation>
		<part name="body" element="rs:RegistryResponse"/>
	</message>
	<portType name="DocumentRepository_PortType">
		<operation name="DocumentRepository_RemoveDocuments">
			<input message="rmd:RemoveDocuments_Message" wsaw:Action="urn:ihe:iti:2017:RemoveDocuments"/>
			<output message="rmd:RemoveDocumentsResponse_Message" wsaw:Action="urn:ihe:iti:2017:RemoveDocumentsResponse"/>
		</operation>
	</portType>
	<binding name="DocumentRepository_Binding_Soap11" type="rmd:DocumentRepository_PortType">
		<wsoap11:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="DocumentRepository_RemoveDocuments">
			<wsoap11:operation soapAction="urn:ihe:iti:2017:RemoveDocuments"/>
			<input>
				<wsoap11:body use="literal"/>
			</input>
			<output>
				<wsoap11:body use="literal"/>
			</output>
		</operation>
	</binding>
	<binding name="DocumentRepository_Binding_Soap12" type="rmd:DocumentRepository_PortType">
		<wsoap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="DocumentRepository_RemoveDocuments">
			<wsoap12:operation soapAction="urn:ihe:iti:2017:RemoveDocuments" soapActionRequired="false"/>
			<input>
				<wsoap12:body use="literal"/>
			</input>
			<output>
				<wsoap12:body use="literal"/>
			</output>
		</operation>
	</binding>		
	<service name="DocumentRepository_Service">
		<port name="DocumentRepository_Port_Soap11" binding="rmd:DocumentRepository_Binding_Soap11">
			<wsoap11:address location="http://servicelocation/DocumentRepository_Service"/>
		</port>
		<port name="DocumentRepository_Port_Soap12" binding="rmd:DocumentRepository_Binding_Soap12">
			<wsoap12:address location="http://servicelocation/DocumentRepository_Service"/>
		</port>		
	</service>
</definitions>