samples/ePA 1 Beispielnachrichten PS - Konnektor/Requests/removedocument.xop

--_MIME_MTOM_Boundary_
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: 8bit
Content-ID: <Start@Request.konlan>

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:m0="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:m1="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:m2="http://ws.gematik.de/fa/phr/v1.1">
  <soap:Header>
    <m:ContextHeader xmlns:m="http://ws.gematik.de/conn/phrs/PHRService/v1.3">
      <m0:Context>
        <m1:MandantId>Mandant1</m1:MandantId>
        <m1:ClientSystemId>ClientID1</m1:ClientSystemId>
        <m1:WorkplaceId>CATS</m1:WorkplaceId>
      </m0:Context>
      <m:RecordIdentifier>
        <m2:InsurantId root="1.2.276.0.76.4.8" extension="X110458421"/>
        <m2:HomeCommunityId>urn:oid:1.2.276.0.76.3.1.321.12.1.60.22</m2:HomeCommunityId>
      </m:RecordIdentifier>
    </m:ContextHeader>
    <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RetrieveDocumentSet</Action>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://10.11.218.161:80/fm/phrservice</To>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">27cda590-b7f4-4bad-8223-0551d56c3238</MessageID>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
  </soap:Header>
  <soap:Body>
    <RemoveDocumentsRequest xmlns="urn:ihe:iti:rmd:2017">
		</RemoveDocumentsRequest>
  </soap:Body>
</soap:Envelope>

--_MIME_MTOM_Boundary_--
